Unix/wsman/samples/Put1.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd"><s:Header><a:To>https://157.59.85.220:7779/wsman</a:To><w:ResourceURI s:mustUnderstand="true">http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/OMI_Identify</w:ResourceURI><a:ReplyTo><a:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address></a:ReplyTo><a:Action s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/Put</a:Action><w:MaxEnvelopeSize s:mustUnderstand="true">512000</w:MaxEnvelopeSize><a:MessageID>uuid:8C9C2A0A-C9A4-44F6-B707-D0608B6953EC</a:MessageID><w:Locale xml:lang="en-US" s:mustUnderstand="false" /><p:DataLocale xml:lang="en-US" s:mustUnderstand="false" /><p:SessionId s:mustUnderstand="false">uuid:7DCF8456-B479-4D56-A777-9477D5E48FE7</p:SessionId><p:OperationID s:mustUnderstand="false">uuid:BF38F445-B125-4C1A-8277-B16241CABD41</p:OperationID><p:SequenceId s:mustUnderstand="false">1</p:SequenceId><w:SelectorSet><w:Selector Name="__cimnamespace">root/omi</w:Selector><w:Selector Name="InstanceID">2FDB5542-5896-45D5-9BE9-DC04430AAABE</w:Selector></w:SelectorSet><w:OptionSet xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><w:Option Name="wmiarray:__MIInstanceModifiedPropertiesList" Type="xs:string">ProductVendor</w:Option><w:Option Name="__MI_CallbackRegistration" Type="xs:int">11</w:Option><w:Option Name="wmiarray:__MI_OPERATIONOPTIONS_CHANNELVALUE" Type="xs:unsignedInt">0</w:Option><w:Option Name="wmiarray:__MI_OPERATIONOPTIONS_CHANNELVALUE" Type="xs:unsignedInt">1</w:Option><w:Option Name="wmiarray:__MI_OPERATIONOPTIONS_CHANNELVALUE" Type="xs:unsignedInt">2</w:Option><w:Option Name="wmi:__MI_OPERATIONOPTIONS_WRITEERRORMODE" Type="xs:unsignedInt">1</w:Option><w:Option Name="msftwinrm:UsePreciseArrays" Type="xs:boolean">true</w:Option></w:OptionSet></s:Header><s:Body><p0:OMI_Identify xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:p0="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/OMI_Identify" xsi:type="p0:OMI_Identify_Type"><p0:InstanceID xsi:type="cim:cimString">2FDB5542-5896-45D5-9BE9-DC04430AAABE</p0:InstanceID><p0:SystemName xsi:type="cim:cimString">hsuzuki-x440sl</p0:SystemName><p0:ProductName xsi:type="cim:cimString">OMI</p0:ProductName><p0:ProductVendor xsi:type="cim:cimString">Microsoft</p0:ProductVendor><p0:ProductVersionMajor xsi:type="cim:cimString">1</p0:ProductVersionMajor><p0:ProductVersionMinor xsi:type="cim:cimString">0</p0:ProductVersionMinor><p0:ProductVersionRevision xsi:type="cim:cimString">2</p0:ProductVersionRevision><p0:ProductVersionString xsi:type="cim:cimString">1.0.2</p0:ProductVersionString><p0:Platform xsi:type="cim:cimString">LINUX_IX86_GNU</p0:Platform><p0:OperatingSystem xsi:type="cim:cimString">LINUX</p0:OperatingSystem><p0:Architecture xsi:type="cim:cimString">IX86</p0:Architecture><p0:Compiler xsi:type="cim:cimString">GNU</p0:Compiler><p0:ConfigPrefix xsi:type="cim:cimString">/opt/omi-1.0.2</p0:ConfigPrefix><p0:ConfigLibDir xsi:type="cim:cimString">/opt/omi-1.0.2/lib</p0:ConfigLibDir><p0:ConfigBinDir xsi:type="cim:cimString">/opt/omi-1.0.2/bin</p0:ConfigBinDir><p0:ConfigIncludeDir xsi:type="cim:cimString">/opt/omi-1.0.2/include</p0:ConfigIncludeDir><p0:ConfigDataDir xsi:type="cim:cimString">/opt/omi-1.0.2/share</p0:ConfigDataDir><p0:ConfigLocalStateDir xsi:type="cim:cimString">/opt/omi-1.0.2/var</p0:ConfigLocalStateDir><p0:ConfigSysConfDir xsi:type="cim:cimString">/opt/omi-1.0.2/etc</p0:ConfigSysConfDir><p0:ConfigProviderDir xsi:type="cim:cimString">/opt/omi-1.0.2/etc</p0:ConfigProviderDir><p0:ConfigLogFile xsi:type="cim:cimString">/opt/omi-1.0.2/var/log/omiserver.log</p0:ConfigLogFile><p0:ConfigPIDFile xsi:type="cim:cimString">/opt/omi-1.0.2/var/run/omiserver.pid</p0:ConfigPIDFile><p0:ConfigRegisterDir xsi:type="cim:cimString">/opt/omi-1.0.2/etc/omiregister</p0:ConfigRegisterDir><p0:ConfigSchemaDir xsi:type="cim:cimString">/opt/omi-1.0.2/share/omischema</p0:ConfigSchemaDir><p0:ConfigNameSpaces xsi:type="cim:cimString">root#omi</p0:ConfigNameSpaces><p0:ConfigNameSpaces xsi:type="cim:cimString">root#check</p0:ConfigNameSpaces><p0:ConfigNameSpaces xsi:type="cim:cimString">interop</p0:ConfigNameSpaces><p0:ConfigNameSpaces xsi:type="cim:cimString">root#cimv2</p0:ConfigNameSpaces></p0:OMI_Identify></s:Body></s:Envelope>
